20230816114747-compiler.org
:PROPERTIES:
:ID:       6cbcac25-a12b-47c0-8183-62d18799835d
:END:
#+title: compiler
* 概要
コンパイラは高水準言語で書かれたコンピュータプログラムを コンピュータが実行や解釈できる形式に変換するソフトウェア。

- [[https://ja.wikipedia.org/wiki/%E3%82%B3%E3%83%B3%E3%83%91%E3%82%A4%E3%83%A9][コンパイラ - Wikipedia]]

* Memo
** オブジェクトファイルと実行ファイルの違い
オブジェクトファイルと実行ファイルの違い。

- オブジェクトファイルはソースコードをコンパイルした後に生成されるファイル
  - 直接実行できないリロケータブルフォーマットのマシンコードを持つオブジェクトコードを含むファイル
  - 中間ファイル
  - コンパイラはソースコードをオブジェクトファイルに変換する
- 実行ファイルはオブジェクトファイルの集合をリンカで連結した後に生成されるファイル
  - コンピュータが直接実行できるファイルで、コード化された命令に従って指示されたタスクを実行することができるもの
  - 最終ファイル
  - リンカはオブジェクトファイルをシステムライブラリとリンクさせ、オブジェクトファイルと結合して実行ファイルを作成する

[[https://toumaswitch.com/ax8xnbbmbm/][オブジェクトファイルと実行可能ファイルの違いとは？分かりやすく解説! | トーマスイッチ]]
* Tasks
* Reference
** [[https://gcc.godbolt.org/][Compiler Explorer]]
アセンブラに変換して確認できるサイト。
* Archives
