20230816114747-compiler.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-02-05 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>compiler</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">compiler</h1>
<div id="outline-container-orgea83bd1" class="outline-2">
<h2 id="orgea83bd1"><a href="#orgea83bd1">概要</a></h2>
<div class="outline-text-2" id="text-orgea83bd1">
<p>
コンパイラは高水準言語で書かれたコンピュータプログラムを コンピュータが実行や解釈できる形式に変換するソフトウェア。
</p>

<ul class="org-ul">
<li><a href="https://ja.wikipedia.org/wiki/%E3%82%B3%E3%83%B3%E3%83%91%E3%82%A4%E3%83%A9">コンパイラ - Wikipedia</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4a70d8e" class="outline-2">
<h2 id="org4a70d8e"><a href="#org4a70d8e">Memo</a></h2>
<div class="outline-text-2" id="text-org4a70d8e">
</div>
<div id="outline-container-orgebe4a33" class="outline-3">
<h3 id="orgebe4a33"><a href="#orgebe4a33">オブジェクトファイルと実行ファイルの違い</a></h3>
<div class="outline-text-3" id="text-orgebe4a33">
<p>
オブジェクトファイルと実行ファイルの違い。
</p>

<ul class="org-ul">
<li>オブジェクトファイルはソースコードをコンパイルした後に生成されるファイル
<ul class="org-ul">
<li>直接実行できないリロケータブルフォーマットのマシンコードを持つオブジェクトコードを含むファイル</li>
<li>中間ファイル</li>
<li>コンパイラはソースコードをオブジェクトファイルに変換する</li>
</ul></li>
<li>実行ファイルはオブジェクトファイルの集合をリンカで連結した後に生成されるファイル
<ul class="org-ul">
<li>コンピュータが直接実行できるファイルで、コード化された命令に従って指示されたタスクを実行することができるもの</li>
<li>最終ファイル</li>
<li>リンカはオブジェクトファイルをシステムライブラリとリンクさせ、オブジェクトファイルと結合して実行ファイルを作成する</li>
</ul></li>
</ul>

<p>
<a href="https://toumaswitch.com/ax8xnbbmbm/">オブジェクトファイルと実行可能ファイルの違いとは？分かりやすく解説! | トーマスイッチ</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org07a64da" class="outline-2">
<h2 id="org07a64da"><a href="#org07a64da">Tasks</a></h2>
</div>
<div id="outline-container-org1739504" class="outline-2">
<h2 id="org1739504"><a href="#org1739504">Reference</a></h2>
<div class="outline-text-2" id="text-org1739504">
</div>
<div id="outline-container-org7e1b81e" class="outline-3">
<h3 id="org7e1b81e"><a href="#org7e1b81e"><a href="https://gcc.godbolt.org/">Compiler Explorer</a></a></h3>
<div class="outline-text-3" id="text-org7e1b81e">
<p>
アセンブラに変換して確認できるサイト。
</p>
</div>
</div>
</div>
<div id="outline-container-org76db86f" class="outline-2">
<h2 id="org76db86f"><a href="#org76db86f">Archives</a></h2>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
